function foldToAssci(input){
    var orgin = [
        'à','á','ả','ã','ạ',
        'A','À','Á','Ả','Ã','Ạ',
        'â','ầ','ấ','ẩ','ẫ','ậ',
        'Â','Ầ','Ấ','Ẩ','Ẫ','Ậ',
        'ă','ằ','ắ','ẳ','ẵ','ặ',
        'Ă','Ằ','Ắ','Ẳ','Ẵ','Ặ',
        'đ', 'Đ',
        'è','é','ẻ','ẽ','ẹ',
        'E','È','É','Ẻ','Ẽ','Ẹ',
        'ê','ề','ế','ể','ễ','ệ',
        'Ê','Ề','Ế','Ể','Ễ','Ệ',
        'ì','í','ỉ','ĩ','ị',
        'I','Ì','Í','Ỉ','Ĩ','Ị',
        'ò','ó','ỏ','õ','ọ',
        'O','Ò','Ó','Ỏ','Õ','Ọ',
        'ô','ồ','ố','ổ','ỗ','ộ',
        'Ô','Ồ','Ố','Ổ','Ỗ','Ộ',
        'ơ','ờ','ớ','ở','ỡ','ợ',
        'Ơ','Ờ','Ớ','Ở','Ỡ','Ợ',
        'ù','ú','ủ','ũ','ụ',
        'U','Ù','Ú','Ủ','Ũ','Ụ',
        'ư','ừ','ứ','ử','ữ','ự',
        'Ư','Ừ','Ứ','Ử','Ữ','Ự',
        'ỳ','ý','ỷ','ỹ','ỵ',
        'Y','Ỳ','Ý','Ỷ','Ỹ','Ỵ',
        'B','C','F','G','H','K','L','M','N','P','Q','R','S','T','V','X',' '
    ];
    var transalte = [
        'a','a','a','a','a',
        'a','a','a','a','a','a',
        'a','a','a','a','a','a',
        'a','a','a','a','a','a',
        'a','a','a','a','a','a',
        'a','a','a','a','a','a',
        'd', 'd',
        'e','e','e','e','e',
        'e','e','e','e','e','e',
        'e','e','e','e','e','e',
        'e','e','e','e','e','e',
        'i','i','i','i','i',
        'i','i','i','i','i','I',
        'o','o','o','o','o',
        'o','o','o','o','o','o',
        'o','o','o','o','o','o',
        'o','o','o','o','o','o',
        'o','o','o','o','o','o',
        'o','o','o','o','o','o',
        'u','u','u','u','u',
        'u','u','u','u','u','u',
        'u','u','u','u','u','u',
        'u','u','u','u','u','u',
        'y','y','y','y','y',
        'y','y','y','y','y','y',
        'b','c','f','g','h','k','l','m','n','p','q','r','s','t','v','x',' '
    ];
    var output='';
    for(var i=0; i<input.length; i++){
        var char = input[i];
        var index = orgin.indexOf(char);
        if( index >= 0){
            char = transalte[index];
        }else if(char == ' '){
            char = '-';
        }
        output+= char;
    }
    return output;
}